const capitals = {
  токіо: "Японії",
  ньюделі: "Індії",
  мехіко: "Мексики",
  каїр: "Єгипту",
  париж: "Франції",
  бангкок: "Таїланду",
  лондон: "Великої Британії",
  берлін: "Німеччини",
  вашингтон: "Сполучених Штатів Америки",
  рим: "Італії",
  мадрид: "Іспанії",
  сеул: "Південної Кореї",
  джакарта: "Індонезії",
  анкара: "Туреччини",
  берн: "Швейцарії",
  брюссель: "Бельгії",
  будапешт: "Угорщини",
  бухарест: "Румунії",
  дакар: "Сенегалу",
  кишинів: "Молдови",
  мінськ: "Білорусі",
  оттава: "Канади",
  найробі: "Кенії",
  осло: "Норвегії",
  пекін: "Китаю",
  амстердам: "Нідерландів",
  варшава: "Польщі",
  вена: "Австрії",
  вільнюс: "Литви",
  браззавіль: "Конго",
  афіни: "Греції",
  белград: "Сербії",
  братислава: "Словаччини",
  дублін: "Ірландії",
  київ: "України",
  копенгаген: "Данії",
  лісабон: "Португалії",
  прага: "Чехії",
  скопє: "Північної Македонії",
  софія: "Болгарії",
  стокгольм: "Швеції",
  таллінн: "Естонії",
  тбілісі: "Грузії",
  тірана: "Албанії",
  асунсьйон: "Парагваю",
  богота: "Колумбії",
  буеносайрес: "Аргентини",
  каракас: "Венесуели",
  лапас: "Болівії",
  ліма: "Перу",
  монтевідео: "Уругваю",
  сантьяго: "Чилі",
  сукурі: "Гайани",
  тегусігальпа: "Гондурасу",
  бразиліа: "Бразилії",
  уланбатор: "Монголії",
  абудабі: "Об'єднаних Арабських Еміратів",
  ашхабад: "Туркменістану",
  багдад: "Іраку",
  баку: "Азербайджану",
  бейрут: "Лівану",
  дакка: "Бангладешу",
  дамаск: "Сирії",
  доха: "Катару",
  ісламабад: "Пакистану",
  кабул: "Афганістану",
  катманду: "Непалу",
  куалалумпур: "Малайзії",
  кувейт: "Кувейту",
  мале: "Мальдів",
  манама: "Бахрейну",
  москва: "Росії",
  ріяд: "Саудівської Аравії",
  сінгапур: "Сінгапуру",
  ташкент: "Узбекистану",
  тегеран: "Ірану",
  канберра: "Австралії",
}

const tempMesForCancel = "Шкода, що Ви не захотіли ввести свій(ю)"

let yearBirth = +prompt("Вкажіть свій рік народження")

if (yearBirth === null) {
  yearBirth = "-"
}

if (isNaN(yearBirth)) {
  yearBirth = +prompt(
    "Ви ввели не числове значення. Введіть свій рік народження в діапазоні від 1900 до 2024"
  )
}

if (yearBirth > 2024 || yearBirth < 1900) {
  yearBirth = +prompt(
    "Ви ввели не реалістичне значення року народження. Введіть свій рік народження в діапазоні від 1900 до 2024"
  )
}

const currentYear = 2024
const messageYearBirth = `Вітаю. В цьому році вам виповнюється ${
  currentYear - yearBirth
} років.`

const valueCity = prompt("Вкажи місто в якому ти живеш.")
let city = valueCity.toLowerCase().replace(/[^a-zA-Z]/g, "")
console.log("1city:", city, !city)
if (!city) {
  city = "-"
}
console.log("2city:", city, city in capitals)

const messageCity = true ? `Ти живеш у столиці...` : `ти живеш у місті ${city}`

let valueFavSport = prompt(
  "Який твій улюблений вид спорту серед перелічених: Футбол, Шахи, Бокс"
)

let favSport = valueFavSport.trim().toLowerCase()

if (!favSport) {
  alert(`${tempMesForCancel} улюблений вид спорту`)
}

if (favSport === "футбол" || favSport === "шахи" || favSport === "бокс") {
  valueFavSport = prompt(
    "Такого спорту не вказано в переліку: Футбол, Шахи, Бокс"
  )
}

console.log("valueFavSport:", valueFavSport)

let champion

switch (favoriteSport) {
  case "футбол":
    champion = "Дієго Марадона"
  case "футбол":
    champion = "Дієго Марадона"
  case "футбол":
    champion = "Дієго Марадона"
}

const favSportMessage = true
  ? `Круто! Хочеш стати як ${champion}`
  : `Твій улюблений вид спорту ${favSport}`

alert(`${messageYearBirth} ${messageCity} ${favSportMessage}`)
